index.org
#+TITLE: Repositorios de José A. Alonso en GitHub

* Con Haskell

** Introducción a la programación funcional con Haskell 
+ [[https://github.com/jaalonso/Examenes_de_PF_con_Haskell][Examenes_de_PF_con_Haskell]]: Exámenes de programación funcional con Haskell.
+ [[https://github.com/jaalonso/Exercitium1314][Exercitium1314]]: Ejercicios de programación funcional con Haskell propuestos
  en el blog Exercitium durante el curso 2013-14. 
+ [[https://github.com/jaalonso/I1M][I1M]]: Código Haskell usado en el curso de I1M (Informática de 1º de
  Matemática). ([[https://jaalonso.github.io/I1M][Documentación]]).
+ [[https://github.com/jaalonso/I1M-Cod-Temas][I1M-Cod-Temas]]: Código Haskell de los temas del curso de I1M (Informática de
  1º de Matemática). ([[https://jaalonso.github.io/I1M-Cod-Temas][Documentación]]).
+ [[https://github.com/jaalonso/I1M-Ejercicios][I1M-Ejercicios]]: Ejercicios de I1M (Informática de 1º del Grado en Matemáticas
  de la Universidad de Sevilla). 

** Lógica
+ [[https://github.com/jaalonso/FormulasYpolinomios][FormulasYpolinomios]]: Sistema certificado de decisión proposicional basado en
  polinomios. ([[https://jaalonso.github.io/FormulasYpolinomios][Documentación]]).  

* Con Isabelle
+ [[https://github.com/jaalonso/AFV][AFV]]: Algorítmica funcional verificada.
+ [[https://github.com/jaalonso/SLP][SLP]]: Semánticas de lenguajes de programación formalizadas en Isabelle/HOL 
+ [[https://github.com/jaalonso/RA20116][RA20116]]: Curso de "Razonamiento automático" (2015-16).

* Textos
+ [[https://github.com/jaalonso/Lecturas_GLC][Lecturas_GLC]]: Lecturas del Grupo de Lógica Computacional.
+ [[https://github.com/jaalonso/Pensamientos][Pensamientos]]: Recopilación de pensamientos. 
+ [[https://github.com/jaalonso/Recopilaciones][Recopilaciones]]: Recopilaciones de cursos y ofertas de trabajo.
