index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-16 dom 17:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Repositorios de José A. Alonso en GitHub</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="José A. Alonso Jiménez" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet"
                       type="text/css"
                       href="http://www.cs.us.es/~jalonso/cursos/i1m-16/temas/estilo.css"
                  />
</head>
<body>
<div id="content">
<h1 class="title">Repositorios de José A. Alonso en GitHub</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. Con Haskell</a>
<ul>
<li><a href="#orgheadline1">1.1. Introducción a la programación funcional con Haskell</a></li>
<li><a href="#orgheadline2">1.2. Lógica</a></li>
</ul>
</li>
<li><a href="#orgheadline4">2. Con Isabelle</a></li>
<li><a href="#orgheadline5">3. Textos</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> Con Haskell</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Introducción a la programación funcional con Haskell</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://github.com/jaalonso/Examenes_de_PF_con_Haskell">Examenes<sub>de</sub><sub>PF</sub><sub>con</sub><sub>Haskell</sub></a>: Exámenes de programación funcional con Haskell.</li>
<li><a href="https://github.com/jaalonso/Exercitium1314">Exercitium1314</a>: Ejercicios de programación funcional con Haskell propuestos
en el blog Exercitium durante el curso 2013-14.</li>
<li><a href="https://github.com/jaalonso/I1M">I1M</a>: Código Haskell usado en el curso de I1M (Informática de 1º de
Matemática). (<a href="https://jaalonso.github.io/I1M">Documentación</a>).</li>
<li><a href="https://github.com/jaalonso/I1M-Cod-Temas">I1M-Cod-Temas</a>: Código Haskell de los temas del curso de I1M (Informática de
1º de Matemática). (<a href="https://jaalonso.github.io/I1M-Cod-Temas">Documentación</a>).</li>
<li><a href="https://github.com/jaalonso/I1M-Ejercicios">I1M-Ejercicios</a>: Ejercicios de I1M (Informática de 1º del Grado en Matemáticas
de la Universidad de Sevilla).</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Lógica</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="https://github.com/jaalonso/FormulasYpolinomios">FormulasYpolinomios</a>: Sistema certificado de decisión proposicional basado en
polinomios. (<a href="https://jaalonso.github.io/FormulasYpolinomios">Documentación</a>).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">2</span> Con Isabelle</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://github.com/jaalonso/AFV">AFV</a>: Algorítmica funcional verificada.</li>
<li><a href="https://github.com/jaalonso/SLP">SLP</a>: Semánticas de lenguajes de programación formalizadas en Isabelle/HOL</li>
<li><a href="https://github.com/jaalonso/RA20116">RA20116</a>: Curso de "Razonamiento automático" (2015-16).</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">3</span> Textos</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://github.com/jaalonso/Lecturas_GLC">Lecturas<sub>GLC</sub></a>: Lecturas del Grupo de Lógica Computacional.</li>
<li><a href="https://github.com/jaalonso/Pensamientos">Pensamientos</a>: Recopilación de pensamientos.</li>
<li><a href="https://github.com/jaalonso/Recopilaciones">Recopilaciones</a>: Recopilaciones de cursos y ofertas de trabajo.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
